package com.smlj.train.logic.o.dto.to.common;

import lombok.AllArgsConstructor;
import lombok.Getter;

// https://github.com/kaclok/springboot-vue/blob/master/yudao-framework/yudao-common/src/main/java/cn/iocoder/yudao/framework/common/exception/enums/GlobalErrorCodeConstants.java#L17
@Getter
@AllArgsConstructor
public enum ReturnCode {
    RC200(200, "成功"),

    // ========== 客户端错误段 ==========
    RC400(400, "请求参数不正确"),
    RC402(401, "请求参数缺失"),
    RC403(403, "无访问权限"),
    RC404(404, "请求未找到"),
    RC405(405, "请求方法不正确"),
    RC407(407, "session已过期,重新刷新验证码"),
    RC423(423, "请求失败，请稍后重试(并发请求，不允许)"),

    RC424(424, "系统维护中，请联系管理员"),

    // ========== 服务端错误段 ==========
    RC500(500, "系统异常"),
    RC501(501, "功能未实现/未开启"),
    RC502(502, "错误的配置项"),

    // ========== 自定义错误段 ==========
    RC900(900, "重复请求，请稍后重试"),
    RC901(901, "禁止写操作"),

    // ========== 登录错误段：10000 ~ 10099 ==========
    RC10000(10000, "用户名或密码错误"),
    RC10001(10001, "该用户不存在"),
    RC10002(10002, "密码错误"),
    RC10003(10003, "账号未登录 或 token校验不正确"),
    RC10004(10004, "token过期或已退出登录"),
    RC10005(10005, "token校验不正确"),
    RC10006(10006, "该用户已经处于登录状态(检查是否在其他设备上登录)"),
    RC10007(10007, "token和当前用户不符"),
    RC10008(10008, "部门id不存在"),
    RC10009(10009, "前后密码不能相同"),
    RC10010(10010, "使用了老的未过期的token(可能是：未重新登录)"),
    RC10011(10011, "修改密码失败"),
    RC10012(10012, "当前用户存在多个身份，请选择一个具体身份"),

    // ========== 文件传输错误段：10100 ~ 10199 ==========
    RC10100(10100, "上传的文件为空"),
    RC10101(10101, "目标文件不存在"),
    RC10102(10102, "不是xlsx文件"),
    RC10103(10103, "xlsx文件内容未按照指定格式填写"),
    RC10104(10104, "文件超过限制大小(单个300MB,总共1000MB)"),
    RC10105(10105, "上传的附件和附件配置个数不匹配"),
    RC10106(10106, "上传的文件列表为空"),
    RC10107(10107, "当前用户不存在于数据库"),
    RC10108(10108, "协议请求过于频繁"),

    RC10200(10200, "获取不到指定的课程信息"),
    RC10203(10203, "获取不到指定的学生课程信息"),
    RC10204(10204, "获取不到指定的学生考试信息"),
    RC10205(10205, "已超过考试次数上限"),
    RC10206(10206, "验证码不正确"),
    RC10207(10207, "已经评价过,不能再次评价"),
    RC10208(10208, "当前培训状态下不能进行此操作"),
    RC10209(10209, "验证码超过了时限(60s)"),
    RC10210(10210, "当前培训状态下不可删除该培训课程"),

    // 保持在最后
    RC_1(-1, "未知错误");

    // 自定义状态码
    private final int code;
    // 自定义描述
    private final String message;
}